[
    {
        "date": "April 2012",
        "title": "First Website",
        "description": "The first site I ever built while still in school. A humble beginning!",
        "link": "https://hss-al.com/",
        "image": "/images/hss-aldotcom-948x589.jpg"
    },
    {
        "date": "August 2013",
        "title": "Industrial Weighing Software",
        "description": "At Mettler Toledo, developed custom weighing software using C# and .NET frameworks. Learned software deployment and integration across various technologies.",
        "link": "",
        "image": "/images/industrialSoftware-mockupImage.jpg"
    },
    {
        "date": "September 2016",
        "title": "DMCEC Website",
        "description": "Built the Decatur Morgan County Entrepreneurial Center website with integrated calendar, email, and custom graphics using HTML, CSS, and JavaScript.",
        "link": "",
        "image": "/images/dmcec-website-2017-948x507.jpg"
    },
    {
        "date": "February 2017",
        "title": "Original Website for Kickin & Screenin",
        "description": "Built the original website for Kickin & Screenin using HTML, CSS, and JavaScript.",
        "link": "https://kickinandscreenin.com",
        "image": ""
    },
    {
        "date": "August 2020",
        "title": "Kickin & Screenin Internal Quote Tool",
        "description": "Built a simple internal quote tool for Kickin & Screenin to help with the quoting process. It was a simple tool that allowed us to quote jobs quickly and easily.",
        "link": "",
        "image": "/images/t-shirtquotetool-948x462.jpg"
    },
    {
        "date": "November 2020",
        "title": "Avery Marie Maternity",
        "description": "Built a complete eCommerce solution with automated messaging and shipping using Ecwid eCommerce and GoDaddy Hosting.",
        "link": "",
        "image": "/images/averymariematernity-site-nov2020-948x438.jpg"
    },
    {
        "date": "February 2021",
        "title": "Recipe Randomizer App",
        "description": "This was my first real application that I built using Svelte.js and SvelteKit. It was a recipe randomizer that would take a users book of recipes and build arandomized menu formy wife to cook for our family. It was a fun project and I learned a lot, but like a lot of side projects it was never finished... 🤔",
        "link": "",
        "image": ""
    },
    {
        "date": "April 2021",
        "title": "Hunny & Babe Company Website",
        "description": "Built a website for the Hunny & Babe Company to help market their products. It was a simple eCommerce website built using Svelte.js and SvelteKit, and BigCommerce for the eCommerce platform.",
        "link": "https://hunnybabe.com",
        "image": "/images/hunnybabeecom-948x437.jpg"
    },
    {
        "date": "October 2021",
        "title": "Beach For House Website",
        "description": "Built a website for Thomas Beach for his run for South Carolina House or Representatives. Integrated his campaign and donations links and appliactions to allow online giving.",
        "link": "",
        "image": "/images/BeachForHouseDotCom_Nov2021.jpg"
    },
    {
        "date": "December 2021",
        "title": "NASA Image of the Day Viewing App",
        "description": "Built a simple app using NASA's API to view the daily image of the day. This application was built using Svelte.js and SvelteKit, it was a real turning point in my web development journey.",
        "link": "https://nasa-images-app-sveltekit-api.vercel.app/",
        "image": "/images/NASA_APOD_imagesAppViewer.jpg"
    },
    {
        "date": "2022",
        "title": "The Year I Discovered Blockchain and Web3",
        "description": "I started learning about blockchain and web3 in 2022. I was fascinated by the potential of the technology and the ability to create decentralized applications. I started learning about Solidity and Ethereum and quickly realized that this was something I wanted to be a part of. I started learning about the different blockchains and the different use cases for each one. I spent a lot of time in the DeFi space, and discovered a whole new passion. Trading and Crypto!",
        "link": "",
        "image": "/images/blockchainAndWeb3image.jpg"
    },
    {
        "date": "October 2022",
        "title": "Trading Bots Consumed My Life",
        "description": "I started building trading bots in 2022. I was fascinated by the potential of the technology and the ability to create decentralized applications. Building out automated trading strategies using TradingView and PineScript, to automate the backtesting and eventually the trading. I slowly lost interest in Web3 and started solidifying my skills in trading.",
        "link": "",
        "image": "/images/tradingBotImage.jpg"
    },
    {
        "date": "February 2023",
        "title": "Trading Became My Passion",
        "description": "Pivoting from trading bots to manual trading changed my outlook on the markets. I started to notice patterns and this led me to start trading on my own. I became a member of the Pack Trade Group, this is where I learned to trade using data and statistics. Changing my trading strategy to a more data-driven approach was a game changer for me. I started to see the markets in a whole new way and I was able to make much better decisions along with implementing risk managment strategies to protect capital as well.",
        "link": "",
        "image": ""
    },
    {
        "date": "August 2023",
        "title": "Kickin & Screenin Website Redesign and eCommerce Platform Migration",
        "description": "Redesigned the website for Kickin & Screenin using Svelte.js and SvelteKit, and Ecwid for the eCommerce platform.",
        "link": "https://kickinandscreenin.com",
        "image": "/images/ks-site-2023-948x456.jpg"
    },
    {
        "date": "March 2024",
        "title": "Building Trading Tools",
        "description": "I have recently started building trading tools to help me become a better trader. The goal is to market these tools once they are complete, if they can help me then they can help other traders as well.",
        "link": "",
        "image": ""
    },
    {
        "date": "June 2024",
        "title": "Kickin & Screenin Website Redesign #2",
        "description": "Redesigned the website for Kickin & Screenin again using the same technology stack as the first redesign. Just a few changes to the design and a few changes to the functionality.",
        "link": "https://kickinandscreenin.com",
        "image": "/images/kands_websiteRedesignV2.jpg"
    },
    {
        "date": "September 2024",
        "title": "Trade Arsenal Webapp",
        "description": "Built a webapp to help me manage my trading. It is a simple webapp that allowed me to perform in depth backtesting, track my trades, and see my performance. It was built using Svelte.js and SvelteKit, and Turso for the database.",
        "link": "",
        "image": ""
    },
    {
        "date": "March 2025",
        "title": "Alabama Reloader Website with Hosted Merch Store Integration",
        "description": "Built a website for Alabama Reloader to help market their products. It has a user backend for the owner to update images, colors, change the text, and add blog posts and links all from inside his own custom login page. It also has a hosted merch store integration with Ecwid, with Kickin & Screenin as his fullfilment service.",
        "link": "https://www.alabamareloader.com/",
        "image": "/images/alabamaRelaoderWebsiteV1.jpg"
    },
    {
        "date": "April 2025",
        "title": "Collab Ads Platform (Paused for now)",
        "description": "Built a platform to help me manage and setup collaborative physical media mailer ads. It is a simple platform that allows me to create, manage, and track my collab ads. It was built using Svelte.js and SvelteKit, and SQlite for the database. I paused this project for now as I was not getting the results/response I was hoping for.",
        "link": "",
        "image": ""
    },
    {
        "date": "July 2025",
        "title": "NCA Tree Software - Demo App",
        "description": "Built a demo app for the National Cemetery Administration to try and secure a contract to help them manage their tree inventory. Can't give away the details on this one as I am still hoping to secure the contract.",
        "link": "",
        "image": ""
    },
    {
        "date": "September 2025",
        "title": "Top Tier Auto Mobile Detailing Website",
        "description": "Built a website for Top Tier Auto Mobile Detailing service company to help with their professional online presence. We knocked this one out of the park with design and functionality.",
        "link": "https://www.thetoptierauto.com/",
        "image": "/images/theTopTierAutoWebsiteV1.jpg"
    },
    {
        "date": "October 2025",
        "title": "SAM Contract WebScraper InternalTool",
        "description": "Built a simple internal tool to help me scrape the SAM contract website to help me find contracts that I can bid on. It scrapes the website, filters the data, saves the data to a database, and then sends me notification emails when new contracts are found.",
        "link": "",
        "image": ""
    }
]              
                  